---
kind: enumMember
id: F:Autodesk.Revit.DB.RevisionNumberType.Alphanumeric
enum: Autodesk.Revit.DB.RevisionNumberType
source: html/9bbde707-5b86-1f51-d6a4-7c12cb8ac6e5.htm
---
# Autodesk.Revit.DB.RevisionNumberType.Alphanumeric

The Revision Number will be a string taken from a user-specified sequence of arbitrary
 strings.